{
  "chunk-67162cadb34748fdcc9db15f5b283c0b": {
    "tokens": 81,
    "content": "La Francia ha stretto un'alleanza con il Regno Unito durante la seconda guerra mondiale.\nGli Stati Uniti si sono alleati con la Francia e il Regno Unito.\nLa Germania si è opposta alle forze alleate.\nL'Unione Sovietica ha combattuto al fianco degli alleati contro la Germania nazista.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-67162cadb34748fdcc9db15f5b283c0b"
  },
  "chunk-9839046c662763f3ca85d5b828a2b6c1": {
    "tokens": 967,
    "content": "﻿ALLEANZE DELLA SECONDA GUERRA MONDIALE\n\nL'ASSE (Potenze dell'Asse)\n\nLa Germania nazista, guidata da Adolf Hitler, e l'Italia fascista, sotto Benito Mussolini, formarono l'Asse Roma-Berlino nel 1936. Questa alleanza militare e politica rappresentava l'unione tra i due regimi totalitari in Europa.\n\nNel 1940, il Giappone imperiale, guidato dall'imperatore Hirohito e dal primo ministro Hideki Tojo, si unì all'alleanza attraverso il Patto Tripartito. Questo accordo creò l'Asse Roma-Berlino-Tokyo, che coordinava le operazioni militari tra Germania, Italia e Giappone.\n\nLa Germania aveva già firmato un patto di non aggressione con l'Unione Sovietica nel 1939, noto come Patto Molotov-Ribbentrop, che includeva una clausola segreta per la spartizione della Polonia. Tuttavia, nel 1941, Hitler violò questo patto invadendo l'Unione Sovietica con l'Operazione Barbarossa.\n\nAltri paesi che si allearono con l'Asse includevano la Romania, guidata da Ion Antonescu, l'Ungheria sotto Miklós Horthy, la Bulgaria di Boris III, e la Croazia indipendente di Ante Pavelić. La Finlandia combatté al fianco della Germania contro l'Unione Sovietica, anche se non firmò formalmente il Patto Tripartito.\n\nGLI ALLEATI (Nazioni Unite)\n\nGli Alleati si formarono gradualmente in risposta all'aggressione dell'Asse. Il Regno Unito, guidato dal primo ministro Winston Churchill, e la Francia, sotto il presidente Albert Lebrun, dichiararono guerra alla Germania nel 1939 dopo l'invasione della Polonia.\n\nNel 1941, dopo l'attacco giapponese a Pearl Harbor, gli Stati Uniti, guidati dal presidente Franklin D. Roosevelt, entrarono in guerra al fianco degli Alleati. L'Unione Sovietica, sotto Joseph Stalin, si unì agli Alleati dopo l'invasione tedesca del 1941.\n\nLa Cina, guidata da Chiang Kai-shek, era già in guerra con il Giappone dal 1937 e si alleò formalmente con gli Alleati nel 1941. Altri paesi che si unirono agli Alleati includevano il Canada, l'Australia, la Nuova Zelanda, l'India britannica, il Brasile, e molti paesi dell'America Latina.\n\nEVENTI CHIAVE DELLE ALLEANZE\n\nLa Conferenza di Teheran del 1943 vide il primo incontro tra i \"Tre Grandi\" leader alleati: Roosevelt, Churchill e Stalin. Questa conferenza stabilì la strategia per l'apertura del secondo fronte in Europa.\n\nLa Conferenza di Yalta del 1945, sempre tra i Tre Grandi, definì la divisione dell'Europa post-bellica e l'organizzazione delle Nazioni Unite. La Conferenza di Potsdam del 1945, con Harry Truman che sostituì Roosevelt, confermò le decisioni di Yalta e stabilì i termini per la resa del Giappone.\n\nLa resa della Germania nel maggio 1945 segnò la fine della guerra in Europa, mentre il Giappone si arrese nel settembre 1945 dopo i bombardamenti atomici di Hiroshima e Nagasaki e l'invasione sovietica della Manciuria.\n\nIMPATTO STORICO\n\nLe alleanze della Seconda Guerra Mondiale trasformarono completamente l'ordine mondiale. La guerra portò alla fine dell'imperialismo europeo, alla nascita delle Nazioni Unite, e all'inizio della Guerra Fredda tra Stati Uniti e Unione Sovietica.\n\nLa collaborazione tra le potenze alleate durante la guerra dimostrò l'importanza della cooperazione internazionale, mentre le alleanze dell'Asse mostrarono i pericoli del nazionalismo estremo e dell'espansionismo militare.",
    "chunk_order_index": 0,
    "full_doc_id": "doc-9839046c662763f3ca85d5b828a2b6c1"
  }
}